import logo from "@assets/img/logo-head-chuan-2005.png"

function Footer () {
    return (
        <>
            <footer className="fade-in footer-container">
                    <div className="footer-main-container">
                        <div className="footer-content">
                            <div className="footer-introduce">
                                <div className="logo-footer">
                                    <img src={logo} alt="" />
                                </div>
                                <p className="footer-description">
                                    Công ty uy tín cho thuê xe máy tại TPHCM và
                                    các tỉnh lân cận. Với hơn 200 + đầu xe các
                                    loại. Chúng tôi tự hòa là doanh nghiệp hàng
                                    đầu trong ngành cho thuê xe máy và được
                                    khách hàng đánh giá cao.
                                </p>
                            </div>
                            <div className="footer-policy">
                                <div className="policy-title">Chính sách chúng
                                    tôi</div>
                                <ul>
                                    <li><a href="#">Chính sách và quy
                                            định</a></li>
                                    <li><a href="#">Quy định khi thuê
                                            xe</a></li>
                                    <li><a href="#">Quy định về thanh
                                            toán</a></li>
                                    <li><a href="#">Chính sách vận chuyển, giao
                                            nhận</a></li>
                                </ul>
                            </div>
                            <div className="footer-contact">
                                <h3 className="company-name">Công Ty TNHH Dịch Vụ Xe
                                    Tốt Xuân Hạnh</h3>
                                <h2 className="website-title">Cho Thuê Xe Máy Sài
                                    Gòn</h2>
                                <ul className="contact-info">
                                    <li className="contact-item">
                                        <span><svg width="30" height="30" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><g id="Address_location"><path d="M327.9166,330.95l-49.2982,67.5545a27.9975,27.9975,0,0,1-45.2334,0L184.0859,330.95C123.3179,339.73,81,359.2774,81,382c0,30.9279,78.35,56,175,56s175-25.0721,175-56C431,359.2778,388.6847,339.7305,327.9166,330.95Z" /><path d="M256,382l92.27-126.4435a114.2248,114.2248,0,1,0-184.54,0Zm0-244.4737a50.7,50.7,0,1,1-50.7,50.7A50.7,50.7,0,0,1,256,137.5264Z" /></g></svg></span>
                                        <span>Địa chỉ: 95/38 Nguyễn Văn Trỗi
                                            Phường 12 Quận Phú Nhuận
                                            TPHCM</span>
                                    </li>
                                    <li className="contact-item">
                                        <span><svg width="30" height="30" version="1.1" id="Icons" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 32 32" style={{ enableBackground: "new 0 0 32 32" }} space="preserve">
                                                <circle className="st1" cx="16" cy="19" r="3" />
                                                <path className="st1" d="M12.7,12h6.6c1.2,0,2.1,0.4,2.1,1.7v0c0,1.3,1,2.3,2.2,2.3H29c0-4.4-3.4-8-7.6-8H10.6C6.4,8,3,11.6,3,16h5.4\n                                c1.2,0,2.2-1.1,2.2-2.3v0C10.6,12.4,11.5,12,12.7,12z" />
                                                <line className="st2" x1="23" y1="25" x2="23" y2="27" />
                                                <line className="st2" x1="9" y1="25" x2="9" y2="27" />
                                                <path className="st1" d="M9,16c-1.5,2.4-3,6.1-3,9v0h20v0c0-2.9-1.5-6.6-3-9" />
                                            </svg></span>
                                        <span>Điện thoại: 0908 630 065</span>
                                    </li>
                                    <li className="contact-item">
                                        <span><svg width="30" height="30" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M4.91001 2.67001V5.50001L3.36002 6.40001C3.06148 6.55518 2.80691 6.78315 2.61988 7.06283C2.43284 7.3425 2.31939 7.66485 2.29002 8.00001V21.33C2.28197 21.3976 2.28938 21.4662 2.31166 21.5305C2.33394 21.5948 2.37053 21.6532 2.41867 21.7014C2.4668 21.7495 2.52523 21.7861 2.58955 21.8084C2.65388 21.8307 2.72242 21.8381 2.79002 21.83H20.93C20.9961 21.8314 21.0617 21.8194 21.123 21.7947C21.1842 21.7701 21.2399 21.7333 21.2866 21.6866C21.3333 21.6399 21.3701 21.5842 21.3947 21.523C21.4194 21.4617 21.4314 21.396 21.43 21.33V8.00001C21.4125 7.67176 21.3115 7.35341 21.1365 7.07515C20.9615 6.79689 20.7183 6.56795 20.43 6.41001L18.82 5.48001V2.67001C18.82 2.53741 18.7673 2.41023 18.6736 2.31646C18.5798 2.22269 18.4526 2.17001 18.32 2.17001H5.41001C5.27821 2.17257 5.15251 2.22607 5.05929 2.31929C4.96608 2.41251 4.91257 2.53821 4.91001 2.67001ZM3.81002 7.28001L4.91001 6.64001V9.94001L3.80002 9.16001C3.63993 9.04754 3.50977 8.89762 3.42088 8.72332C3.33199 8.54903 3.28706 8.35564 3.29002 8.16001C3.28952 7.98012 3.33757 7.80343 3.42908 7.64855C3.5206 7.49368 3.6522 7.36636 3.81002 7.28001V7.28001ZM3.29002 10L11 15.43L3.32002 20.43L3.29002 10ZM4.48002 20.8L11.86 16L19.24 20.79L4.48002 20.8ZM18.81 6.64001L19.92 7.28001C20.0748 7.37397 20.203 7.50602 20.2923 7.66358C20.3815 7.82113 20.429 7.99893 20.43 8.18001C20.4338 8.37579 20.3893 8.56949 20.3003 8.74393C20.2114 8.91837 20.0807 9.06816 19.92 9.18001L18.81 9.96001V6.64001ZM20.43 10V20.41L12.76 15.41L20.43 10ZM5.91001 3.17001H17.81V10.65L11.86 14.84L5.91001 10.65V3.17001Z" fill="black" />
                                                <path d="M12.6 12.42H11.4C11.2682 12.4226 11.1425 12.4761 11.0493 12.5693C10.9561 12.6625 10.9026 12.7882 10.9 12.92C10.9 13.0526 10.9527 13.1798 11.0465 13.2736C11.1402 13.3673 11.2674 13.42 11.4 13.42H12.6C12.7326 13.42 12.8598 13.3673 12.9536 13.2736C13.0473 13.1798 13.1 13.0526 13.1 12.92C13.0975 12.7882 13.044 12.6625 12.9507 12.5693C12.8575 12.4761 12.7318 12.4226 12.6 12.42Z" fill="black" />
                                                <path d="M13.76 4.71002C13.323 4.47747 12.8436 4.33546 12.3505 4.29251C11.8574 4.24955 11.3606 4.30653 10.89 4.46002C10.054 4.72757 9.33913 5.28138 8.87118 6.02401C8.40322 6.76665 8.21216 7.65052 8.33161 8.52013C8.45106 9.38974 8.87337 10.1894 9.52424 10.7783C10.1751 11.3673 11.0128 11.7078 11.89 11.74V11.74C12.0201 11.7376 12.1444 11.6855 12.2374 11.5944C12.3303 11.5033 12.3849 11.3801 12.39 11.25C12.3927 11.1191 12.344 10.9923 12.2542 10.8969C12.1645 10.8016 12.0409 10.7452 11.91 10.74C11.4997 10.7282 11.0974 10.624 10.733 10.4352C10.3685 10.2465 10.0513 9.97793 9.80501 9.64963C9.55868 9.32133 9.38954 8.94172 9.31018 8.53902C9.23081 8.13633 9.24327 7.72093 9.34662 7.32372C9.44998 6.9265 9.64156 6.55771 9.90713 6.24476C10.1727 5.93182 10.5054 5.68278 10.8805 5.51618C11.2556 5.34958 11.6635 5.2697 12.0737 5.28248C12.4839 5.29527 12.886 5.40039 13.25 5.59002C13.8293 5.85981 14.2789 6.34691 14.5017 6.94583C14.7244 7.54476 14.7022 8.20731 14.44 8.79002V8.79002C14.3919 8.92853 14.3033 9.04935 14.1855 9.13675C14.0678 9.22415 13.9265 9.27407 13.78 9.28002C13.7583 9.27925 13.737 9.27343 13.7179 9.26302C13.6988 9.2526 13.6824 9.23788 13.67 9.22002C13.6086 9.1589 13.5728 9.07663 13.57 8.99002C13.57 8.79002 13.57 6.05002 13.57 6.15002C13.57 6.01742 13.5173 5.89024 13.4236 5.79647C13.3298 5.7027 13.2026 5.65002 13.07 5.65002C12.9504 5.65124 12.8352 5.69529 12.7453 5.77418C12.6554 5.85308 12.5967 5.96159 12.58 6.08002C12.3451 5.9475 12.0797 5.87857 11.81 5.88002C11.2918 5.92839 10.8128 6.17689 10.4748 6.57274C10.1369 6.96859 9.96653 7.4806 10 8.00002C9.95844 8.526 10.1264 9.04709 10.4673 9.44979C10.8082 9.85249 11.2944 10.1042 11.82 10.15C12.1878 10.1366 12.5403 9.99919 12.82 9.76002C12.8538 9.83241 12.8976 9.89972 12.95 9.96002C13.0565 10.07 13.1839 10.1576 13.3247 10.2177C13.4655 10.2778 13.6169 10.3092 13.77 10.31C14.1183 10.3048 14.4568 10.194 14.7407 9.99222C15.0246 9.79044 15.2406 9.50722 15.36 9.18002C15.7265 8.37311 15.7644 7.45522 15.4657 6.62084C15.167 5.78645 14.5553 5.10112 13.76 4.71002V4.71002ZM11.84 9.13002C11.44 9.13002 11.02 8.67002 11.02 7.98002C10.9941 7.72385 11.068 7.46756 11.2264 7.26452C11.3847 7.06148 11.6153 6.92734 11.87 6.89002C12.31 6.89002 12.61 7.33002 12.62 7.95002V8.00002C12.61 8.61002 12.27 9.13002 11.84 9.13002Z" fill="black" />
                                            </svg></span>
                                        <span>Email:
                                            hanhduong.2006@yahoo.com</span>
                                    </li>
                                    <li className="contact-item">
                                        <span><svg width="30" height="30" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 45.3 45.6" enableBackground="new 0 0 45.3 45.6" space="preserve">
                                                <g>

                                                    <circle fill="none" stroke="#111B44" strokeWidth={1.3469} strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit={10} cx="22.4" cy="23.1" r="18.9" />

                                                    <ellipse fill="none" stroke="#111B44" strokeWidth={1.3469} strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit={10} cx="22.4" cy="23.1" rx="7" ry="18.9" />

                                                    <path fill="none" stroke="#111B44" strokeWidth={1.3469} strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit={10} d="\n                                    M22.4,13.4c-5.5,0-10.5-1.2-13.9-3c-3.1,3.4-4.9,7.8-4.9,12.7c0,4.9,1.9,9.3,4.9,12.7c3.4-1.8,8.4-3,13.9-3s10.5,1.2,13.9,3\n                                    c3.1-3.4,4.9-7.8,4.9-12.7c0-4.9-1.9-9.3-4.9-12.7C32.9,12.3,27.9,13.4,22.4,13.4z" />

                                                    <polyline fill="none" stroke="#111B44" strokeWidth={1.3469} strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit={10} points="\n                                    18.4,20.4 20.3,25.8 22.5,21.1 24.3,25.8 26.4,20.4 \t" />

                                                    <polyline fill="none" stroke="#111B44" strokeWidth={1.3469} strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit={10} points="\n                                    31.1,20.4 33.1,25.8 35.2,21.1 37.1,25.8 39.1,20.4 \t" />

                                                    <polyline fill="none" stroke="#111B44" strokeWidth={1.3469} strokeLinecap="round" strokeLinejoin="round" strokeMiterlimit={10} points="\n                                    5.4,20.4 7.4,25.8 9.5,21.1 11.3,25.8 13.4,20.4 \t" />
                                                </g>
                                            </svg></span>
                                        <span>Website:
                                            https://chothuexemaysaigon.com</span>
                                    </li>
                                </ul>
                            </div>
                        </div>
                    </div>
                    <div className="footer-copyright">
                        <div className="footer-copyright-content">
                            <div>Website <strong>Cho Thuê Xe Máy Sài
                                    Gòn</strong> thuộc sở hữu <strong>CÔNG TY
                                    TNHH XE TỐT XUÂN HẠNH</strong></div>
                        </div>
                    </div>
                
            </footer>
        </>
    )
}

export default Footer